Revit 2026 API

# RebarConstraintType Enumeration

---

The various types of constraints that can be applied to a RebarConstrainedHandle.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RebarConstraintType
```
```vb
Public Enumeration RebarConstraintType
```
```cpp
public enum class RebarConstraintType
```
```fsharp
type RebarConstraintType
```

| Member name | Value | Description |
| --- | --- | --- |
| FixedDistanceToHostFace | 0 | Handle is constrained to remain a fixed distance from a host Element surface. |
| ToCover | 1 | Handle is attached to the cover of a host Element surface. |
| ToOtherRebar | 2 | Handle is attached to a handle on another Rebar Element. It doesn't matter the style (Standard/Stirrup) of this or the other Rebar element. |
| ToSurface | 3 | Handle is constrained to a surface. |

#### Reference

Autodesk.Revit.DB.Structure Namespace